app/controllers/students_controller.rb

  def show   #this is still showing '/students/:id' it just ommits a lot of text
    @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]